
* CIM 2023
*** Workouts
***** 2023-08-07
      |       Date | Distance (mi) |     Time |     Pace |  HR |
      |------------+---------------+----------+----------+-----|
      | 2023-08-07 |           7.2 | 00:56:42 | 00:07:52 | 167 |
      | 2023-08-08 |           7.2 | 00:58:33 | 00:08:08 | 173 |
      | 2023-08-10 |           7.2 | 00:57:45 | 00:08:01 | 163 |
      | 2023-08-11 |           7.2 | 00:58:42 | 00:08:09 | 162 |
      | 2023-08-12 |            11 | 01:28:39 | 00:08:04 | 156 |
      |------------+---------------+----------+----------+-----|
      |     Totals |          39.8 | 05:20:21 |          |     |
      |------------+---------------+----------+----------+-----|
      #+TBLFM: @>$2=vsum(@2$2..@II$2)::@>$3=vsum(@2$3..@II$3);T::@2$4..@II$4=$3/$2;TEN
***** 2023-08-14
        |       Date | Distance (mi) |     Time |     Pace |  HR |
        |------------+---------------+----------+----------+-----|
        | 2023-08-15 |           7.2 | 00:57:45 | 00:08:01 | 172 |
        | 2023-08-16 |           7.2 | 00:58:03 | 00:08:04 | 174 |
        | 2023-08-18 |           7.2 | 00:57:42 | 00:08:01 | 169 |
        | 2023-08-19 |           7.2 | 00:55:21 | 00:07:41 | 161 |
        | 2023-08-20 |         11.62 | 01:33:35 | 00:08:03 | 167 |
        |------------+---------------+----------+----------+-----|
        |     Totals |         40.42 | 05:22:26 |          |     |
        |------------+---------------+----------+----------+-----|
        #+TBLFM: @>$3=vsum(@2$3..@II$3);T::@>$2=vsum(@2$2..@II$2)::@2$4..@II$4=$3/$2;TEN
***** 2023-08-21
        |       Date | Distance (mi) |     Time |     Pace |  HR |
        |------------+---------------+----------+----------+-----|
        | 2023-08-22 |           7.2 | 00:55:44 | 00:07:44 | 167 |
        | 2023-08-25 |           7.2 | 00:56:14 | 00:07:49 | 170 |
        | 2023-08-26 |          12.8 | 01:53:57 | 00:08:54 | 165 |
        | 2023-08-27 |           7.2 | 00:59:26 | 00:08:15 | 163 |
        |------------+---------------+----------+----------+-----|
        |     Totals |          34.4 | 04:45:21 |          |     |
        |------------+---------------+----------+----------+-----|
        #+TBLFM: @>$3=vsum(@2$3..@II$3);T::@>$2=vsum(@2$2..@II$2)::@2$4..@II$4=$3/$2;TEN
***** 2023-08-28
        |       Date | Distance (mi) |     Time |     Pace |  HR |
        |------------+---------------+----------+----------+-----|
        | 2023-08-29 |           7.2 | 00:56:26 | 00:07:50 | 167 |
        | 2023-08-31 |           7.2 | 00:59:43 | 00:08:18 | 164 |
        | 2023-09-02 |          10.9 | 01:29:24 | 00:08:12 | 170 |
        | 2023-09-03 |          12.3 | 01:46:48 | 00:08:41 | 157 |
        |------------+---------------+----------+----------+-----|
        |     Totals |          37.6 | 05:12:21 |          |     |
        |------------+---------------+----------+----------+-----|
        #+TBLFM: @>$3=vsum(@2$3..@II$3);T::@>$2=vsum(@2$2..@II$2)::@2$4..@II$4=$3/$2;TEN
***** 2023-09-04
        |       Date | Distance (mi) |     Time |     Pace |  HR |
        |------------+---------------+----------+----------+-----|
        | 2023-09-05 |           7.2 | 00:57:32 | 00:07:59 | 167 |
        | 2023-09-07 |           7.2 | 00:56:57 | 00:07:55 | 159 |
        | 2023-09-08 |           7.2 | 00:58:41 | 00:08:09 | 165 |
        | 2023-09-09 |           8.4 | 01:08:03 | 00:08:06 | 166 |
        | 2023-09-10 |          13.1 | 01:56:51 | 00:08:55 | 169 |
        |------------+---------------+----------+----------+-----|
        |     Totals |          43.1 | 05:58:04 |          |     |
        |------------+---------------+----------+----------+-----|
        #+TBLFM: @>$3=vsum(@2$3..@II$3);T::@>$2=vsum(@2$2..@II$2)::@2$4..@II$4=$3/$2;TEN
***** 2023-09-11
        |       Date | Distance (mi) |     Time |     Pace |  HR |
        |------------+---------------+----------+----------+-----|
        | 2023-09-13 |           7.2 | 00:58:08 | 00:08:04 | 165 |
        | 2023-09-14 |           7.2 | 00:58:42 | 00:08:09 | 171 |
        | 2023-09-15 |           7.2 | 00:58:25 | 00:08:07 | 168 |
        | 2023-09-16 |           8.4 | 01:12:53 | 00:08:41 | 161 |
        | 2023-09-17 |         10.85 | 01:40:55 | 00:09:18 | 161 |
        |------------+---------------+----------+----------+-----|
        |     Totals |         40.85 | 05:49:03 |          |     |
        |------------+---------------+----------+----------+-----|
        #+TBLFM: @>$3=vsum(@2$3..@II$3);T::@>$2=vsum(@2$2..@II$2)::@2$4..@II$4=$3/$2;TEN
***** 2023-09-18
      Did not run due to bad AQI
      |       Date | Distance (mi) |     Time |     Pace |  HR |
      |------------+---------------+----------+----------+-----|
      | 2023-09-19 |             0 | 00:00:00 | 00:00:00 |   0 |
      | 2023-09-20 |             0 | 00:00:00 | 00:00:00 |   0 |
      | 2023-09-22 |             0 | 00:00:00 | 00:00:00 |   0 |
      | 2023-09-23 |             0 | 00:00:00 | 00:00:00 |   0 |
      | 2023-09-24 |         10.04 | 01:27:25 | 00:08:42 | 167 |
      |------------+---------------+----------+----------+-----|
      |     Totals |         10.04 | 01:27:25 |          |     |
      |------------+---------------+----------+----------+-----|
      #+TBLFM: @>$3=vsum(@2$3..@II$3);T::@>$2=vsum(@2$2..@II$2)::@2$4..@II$4=$3/$2;TEN
***** 2023-09-25
      |       Date | Distance (mi) |     Time |     Pace |  HR |
      |------------+---------------+----------+----------+-----|
      | 2023-09-26 |           7.2 | 01:02:39 | 00:08:42 | 168 |
      | 2023-09-27 |           7.2 | 01:02:22 | 00:08:40 | 167 |
      | 2023-09-28 |           7.2 | 01:04:16 | 00:08:56 | 162 |
      | 2023-09-29 |           7.2 | 01:02:14 | 00:08:39 | 164 |
      | 2023-09-30 |         13.58 | 01:58:44 | 00:08:45 | 163 |
      | 2023-10-01 |           8.5 | 01:09:42 | 00:08:12 | 162 |
      |------------+---------------+----------+----------+-----|
      |     Totals |         50.88 | 07:19:57 | 00:08:39 |     |
      |------------+---------------+----------+----------+-----|
      #+TBLFM: @>$4=@>$3/@>$2;TEN::@>$3=vsum(@2$3..@II$3);T::@>$2=vsum(@2$2..@II$2)::@2$4..@II$4=$3/$2;TEN
***** 2023-10-02
      |       Date | Distance (mi) |     Time |     Pace |  HR |
      |------------+---------------+----------+----------+-----|
      | 2023-10-03 |           7.2 | 00:59:42 | 00:08:18 | 159 |
      | 2023-10-04 |           7.2 | 01:04:14 | 00:08:55 | 167 |
      | 2023-10-06 |          10.3 | 01:29:50 | 00:08:43 | 164 |
      | 2023-10-07 |          10.7 | 01:31:29 | 00:08:33 | 157 |
      | 2023-10-08 |            15 | 02:09:22 | 00:08:37 | 155 |
      |------------+---------------+----------+----------+-----|
      |     Totals |          50.4 | 07:14:37 | 00:08:37 |     |
      |------------+---------------+----------+----------+-----|
      #+TBLFM: @>$2=vsum(@2$2..@II$2)::@>$3=vsum(@2$3..@II$3);T::@>$4=@>$3/@>$2;TEN::@2$4..@II$4=$3/$2;TEN
***** 2023-10-09
      Low mileage due to travel
      |       Date | Distance (mi) |     Time |     Pace |  HR |
      |------------+---------------+----------+----------+-----|
      | 2023-10-10 |           7.2 | 00:58:16 | 00:08:06 | 157 |
      | 2023-10-11 |           7.2 | 00:58:54 | 00:08:11 | 163 |
      |------------+---------------+----------+----------+-----|
      |     Totals |          14.4 | 01:57:10 | 00:08:08 |     |
      |------------+---------------+----------+----------+-----|
      #+TBLFM: @>$2=vsum(@2$2..@II$2)::@>$3=vsum(@2$3..@II$3);T::@>$4=@>$3/@>$2;TEN::@2$4..@II$4=$3/$2;TEN
***** 2023-10-16
      |       Date | Distance (mi) |     Time |     Pace |  HR |
      |------------+---------------+----------+----------+-----|
      | 2023-10-17 |           7.2 | 01:04:25 | 00:08:57 | 170 |
      | 2023-10-18 |           7.2 | 01:05:06 | 00:09:02 | 169 |
      | 2023-10-20 |          10.7 | 01:27:13 | 00:08:09 | 158 |
      | 2023-10-21 |          10.7 | 01:31:29 | 00:08:33 | 157 |
      | 2023-10-22 |            15 | 02:09:22 | 00:08:37 | 155 |
      |------------+---------------+----------+----------+-----|
      |     Totals |          50.8 | 07:17:35 | 00:08:37 |     |
      |------------+---------------+----------+----------+-----|
      #+TBLFM: @>$2=vsum(@2$2..@II$2)::@>$3=vsum(@2$3..@II$3);T::@>$4=@>$3/@>$2;TEN::@2$4..@II$4=$3/$2;TE
*** Tools
    #+begin_src emacs-lisp
      (defun run/convert-to-seconds (time)
        (cl-destructuring-bind (s m h &rest _) (parse-time-string time)
          (+ s (* 60 m) (* 60 (* 60 h)))))

      (defun run/determine-hours (s)
        (--> (floor (/ s 3600))
             (cons it (- s (* it 3600)))))

      (defun run/determine-minutes (state)
        (cl-destructuring-bind (h . s) state
          (--> (floor (/ s 60))
               (cons (list h it) (- s (* it 60))))))

      (defun run/determine-seconds (state)
        (cl-destructuring-bind ((h m) . s) state
          (list h m s)))

      (defun run/construct-time-string (state)
        (cl-destructuring-bind (h m s) state
          (format "%02d:%02d:%02d" h m s)))

      (defun run/convert-to-time-string (s)
        (->> (run/determine-hours s)
             (run/determine-minutes)
             (run/determine-seconds)
             (run/construct-time-string)))

      (defun run/calculate-time (distance pace)
        (->> (run/convert-to-seconds pace)
             (* distance)
             (run/convert-to-time-string)))

      (defun run/calculate-pace (distance time)
        (--> (run/convert-to-seconds time)
             (/ it distance)
             (run/convert-to-time-string it)))

      (defun run/pace (distance time)
        (interactive "nDistance (mi): \nsTime (xx:xx:xx): ")
        (->> (run/calculate-pace distance time)
             (format "%s per mile")
             (message)))

      (defun run/time (distance pace)
        (interactive "nDistance (mi): \nsPace (xx:xx:xx): ")
        (->> (run/calculate-time distance pace)
             (message)))
    #+end_src
